; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	image0 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Phenomenon8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 spectrograph2)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Planet13 spectrograph1)
	(have_image Planet14 spectrograph2)
	(have_image Star15 image0)
))

)

; plan
1. (turn_to satellite0 groundstation2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet11)
   goals met: 0 of 9
5. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 1 of 9
6. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 9
7. (take_image satellite0 planet10 instrument0 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon8 instrument0 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon12 instrument0 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 4 of 9
12. (turn_to satellite0 planet13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet13)
   goals met: 4 of 9
13. (take_image satellite0 planet13 instrument0 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 5 of 9
14. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 5 of 9
15. (take_image satellite0 planet14 instrument0 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 6 of 9
16. (turn_to satellite0 planet9 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet9)
   goals met: 6 of 9
17. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 7 of 9
18. (turn_to satellite0 star15 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star15)
   goals met: 7 of 9
19. (take_image satellite0 star15 instrument0 image0)
   added: (have_image star15 image0)
   goals met: 8 of 9
20. (turn_to satellite0 star5 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star5)
   goals met: 9 of 9
